/* NSButton (Don't show this again.) : <title:Don't show this again.> (oid:12) */
"Don't show this again." = "Älä näytä tätä enää.";

/* NSButton (Donate!) : <title:Donate!> (oid:7) */
"Donate!" = "Lahjoita!";

/* NSTextField (It has taken many nights to develop this application. If you enjoy using it, please consider a donation to the author (that's me!) of this software. It will encourage me to make it better, really!) : <title:It has taken many nights to develop this application. If you enjoy using it, please consider a donation to the author (that's me!) of this software. It will encourage me to make it better, really!> (oid:9) */
"It has taken many nights to develop this application. If you enjoy using it, please consider a donation to the author (that's me!) of this software. It will encourage me to make it better, really!" = "Tämän ohjelman tekeminen on vienyt monta yötä. Jos koet ohjelman hyödylliseksi, voit tehdä lahjoituksen tekijälle (siiis minulle!). Se kannustaa tekemään ohjelmasta vielä paremman, oikeasti!";

/* NSButton (Later) : <title:Later> (oid:11) */
"Later" = "Myöhemmin";

/* NSWindow (Please Donate) : <title:Please Donate> (oid:5) */
"Please Donate" = "Ole hyvä ja lahjoita!";

/* NSTextField (Thank you for using Cyberduck!) : <title:Thank you for using Cyberduck!> (oid:10) */
"Thank you for using Cyberduck!" = "Kiitos että käuytät Cyberduckia!";

/* NSTextField (The transaction can be made easily over the Internet using PayPal.) : <title:The transaction can be made easily over the Internet using PayPal.> (oid:19) */
"The transaction can be made easily over the Internet using PayPal." = "Lahjoitus voidaan tehdä suoraan Internetissä käyttäen PayPal-palvelua.";

